#include <flipper_application.h>
#include "../../metroflip_i.h"

#include <nfc/protocols/mf_classic/mf_classic_poller_sync.h>
#include <nfc/protocols/mf_classic/mf_classic.h>
#include <nfc/protocols/mf_classic/mf_classic_poller.h>
#include "../../api/metroflip/metroflip_api.h"

#include <dolphin/dolphin.h>
#include <bit_lib.h>
#include <furi_hal.h>
#include <nfc/nfc.h>
#include <nfc/nfc_device.h>
#include <nfc/nfc_listener.h>
#include "../../api/metroflip/metroflip_api.h"
#include "../../metroflip_plugins.h"


#include <datetime.h>
#include <furi/core/string.h>
#include <furi_hal_rtc.h>

#define TAG "Metroflip:Scene:Troika"


void render_section_header(
    FuriString* str,
    const char* name,
    uint8_t prefix_separator_cnt,
    uint8_t suffix_separator_cnt) {
    for(uint8_t i = 0; i < prefix_separator_cnt; i++) {
        furi_string_cat_printf(str, ":");
    }
    furi_string_cat_printf(str, "[ %s ]", name);
    for(uint8_t i = 0; i < suffix_separator_cnt; i++) {
        furi_string_cat_printf(str, ":");
    }
}

void from_days_to_datetime(uint32_t days, DateTime* datetime, uint16_t start_year) {
    uint32_t timestamp = days * 24 * 60 * 60;
    DateTime start_datetime = {0};
    start_datetime.year = start_year - 1;
    start_datetime.month = 12;
    start_datetime.day = 31;
    timestamp += datetime_datetime_to_timestamp(&start_datetime);
    datetime_timestamp_to_datetime(timestamp, datetime);
}

void from_minutes_to_datetime(uint32_t minutes, DateTime* datetime, uint16_t start_year) {
    uint32_t timestamp = minutes * 60;
    DateTime start_datetime = {0};
    start_datetime.year = start_year - 1;
    start_datetime.month = 12;
    start_datetime.day = 31;
    timestamp += datetime_datetime_to_timestamp(&start_datetime);
    datetime_timestamp_to_datetime(timestamp, datetime);
}

void from_seconds_to_datetime(uint32_t seconds, DateTime* datetime, uint16_t start_year) {
    uint32_t timestamp = seconds;
    DateTime start_datetime = {0};
    start_datetime.year = start_year - 1;
    start_datetime.month = 12;
    start_datetime.day = 31;
    timestamp += datetime_datetime_to_timestamp(&start_datetime);
    datetime_timestamp_to_datetime(timestamp, datetime);
}

typedef struct {
    uint16_t view; //101
    uint16_t type; //102
    uint8_t layout; //111
    uint8_t layout2; //112
    uint16_t blank_type; //121
    uint16_t type_of_extended; //122
    uint8_t extended; //123
    uint8_t benefit_code; //124
    uint32_t number; //201
    uint16_t use_before_date; //202
    uint16_t use_before_date2; //202.2
    uint16_t use_with_date; //205
    uint8_t requires_activation; //301
    uint16_t activate_during; //302
    uint16_t extension_counter; //304
    uint8_t blocked; //303
    uint32_t valid_from_date; //311
    uint16_t valid_to_date; //312
    uint8_t valid_for_days; //313
    uint32_t valid_for_minutes; //314
    uint16_t valid_for_time; //316
    uint16_t valid_for_time2; //316.2
    uint32_t valid_to_time; //317
    uint16_t remaining_trips; //321
    uint8_t remaining_trips1; //321.1
    uint32_t remaining_funds; //322
    uint16_t total_trips; //331
    uint16_t start_trip_date; //402
    uint16_t start_trip_time; //403
    uint32_t start_trip_neg_minutes; //404
    uint32_t start_trip_minutes; //405
    uint8_t start_trip_seconds; //406
    uint8_t minutes_pass; //412
    uint8_t passage_5_minutes; //413
    uint8_t metro_ride_with; //414
    uint8_t transport_type; //421
    uint8_t transport_type_flag; //421.0
    uint8_t transport_type1; //421.1
    uint8_t transport_type2; //421.2
    uint8_t transport_type3; //421.3
    uint8_t transport_type4; //421.4
    uint16_t validator; //422
    uint8_t validator1; //422.1
    uint16_t validator2; //422.2
    uint16_t route; //424
    uint8_t passage_in_metro; //431
    uint8_t transfer_in_metro; //432
    uint8_t passages_ground_transport; //433
    uint8_t fare_trip; //441
    uint16_t crc16; //501.1
    uint16_t crc16_2; //501.2
    uint32_t hash; //502
    uint16_t hash1; //502.1
    uint32_t hash2; //502.2
    uint8_t geozone_a; //GeoZoneA
    uint8_t geozone_b; //GeoZoneB
    uint8_t company; //Company
    uint8_t units; //Units
    uint64_t rfu1; //rfu1
    uint16_t rfu2; //rfu2
    uint32_t rfu3; //rfu3
    uint8_t rfu4; //rfu4
    uint8_t rfu5; //rfu5
    uint8_t write_enabled; //write_enabled
    uint32_t tech_code; //TechCode
    uint8_t interval; //Interval
    uint16_t app_code1; //AppCode1
    uint16_t app_code2; //AppCode2
    uint16_t app_code3; //AppCode3
    uint16_t app_code4; //AppCode4
    uint16_t type1; //Type1
    uint16_t type2; //Type2
    uint16_t type3; //Type3
    uint16_t type4; //Type4
    uint8_t zoo; //zoo
} BlockData;

void parse_layout_2(BlockData* data_block, const MfClassicBlock* block) {
    data_block->view = bit_lib_get_bits_16(block->data, 0x00, 10); //101
    data_block->type = bit_lib_get_bits_16(block->data, 0x0A, 10); //102
